# for x in range(1900, 2021):
#     for y in range(2, x):
#         if x % y == 0:
#             break
#     else:
#         # x = str(x)
#         print(x)
# #
# for
# s = 11010120210221999
# print(s%10)

# for i in range(2, 19):
#     w = 2**(i-1) % 11
#     print(w)

# print(18+36+72+5+20+18+15+29)
# print(213%11)
# for n in range(11):
#     if (213+n)%11==1:
#         print(n)
#

# se = {'1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
#       '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----', }
# n = input()
# for i in n:
#     r = se[i]
#     print(r, end='\t')

mos = {'1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
       '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----', }
n = int(input("行数："))
str0 = ""
for _ in range(n):
    m = input("一段数字:")
    for i in m:
        r = mos[i]
        # print(r, end=' ')
        str0 += r+" "
    str0 += "\n"  # 神之一手，困扰了我多日的问题终于解决了！21.4.25晚自习
print(format(str0))
